loadtests/loadtest.yaml
config:
  target: "http://localhost"
  phases:
    - duration: 30
      arrivalRate: 66
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "PUT /store"
    flow:
      - http:
          method: "PUT"
          url: "/store"
          json:
            data:
              key: "{{ $randomInt(1, 1000000) }}"
              value: "valor-{{ $timestamp }}"